// تشخیص کامل بودن عدد
//حالا میخوایم از کاربر یک ورودی بگیریم که طرف ببینه عدد
// کامل هستش یا نه
let input = 8128;
// این وقتی حلقه میچرخه و یک قدم میره جلوتر بیاد اینارو با هم جمع بزنه و داخل یک متغیر نگهش دارم
let temt = 0;
// اینجا میگیم جمع مقسوم علیه به جز خودش
//دیگه نمیگیم که کاونتر کوچیکتر مساوی با اینپوت
for (let counter = 0; counter < input; counter++) {
    if (input & counter == 0) {
        temt = temt + counter;
    }
}

if (temt == input) {
    console.log("PerfectNumber: " , temt);
} 